""" """
"""
1) Используя распаковку в цикле, вычислите средний балл каждого студента
students_grades = [
#     ("Алексей", "математика", 85, 92, 78),
#     ("Мария", "физика", 90, 88, 95),
#     ("Иван", "информатика", 76, 85, 80),
#     ("Елена", "математика", 92, 96, 89),
#     ("Дмитрий", "физика", 82, 79, 85)
# ]
"""

students_grades = [
    ("Алексей", "математика", 85, 92, 78),
    ("Мария", "физика", 90, 88, 95),
    ("Иван", "информатика", 76, 85, 80),
    ("Елена", "математика", 92, 96, 89),
    ("Дмитрий", "физика", 82, 79, 85)
]


for name, subject, point1, point2, point3 in students_grades:
    medium = (point1 + point2 + point3) / 3
    print(f'Имя: {name}\nПредмет: {subject}\nСредний балл: {medium}')
    print("-" * 20)
